<template>
  <div id="kpi">
    <div class="top">
      <p>满意度+装维质量</p>
      <dv-scroll-board :config="config" style="width: 100%; height: 95%" />
    </div>
    <div class="bottom">
      <p style="margin-top: 20px">家宽装维质量</p>
      <dv-scroll-board :config="config2" style="width: 100%; height: 95%" />
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      config: {
        header: ["区县", "装机满意度", "修障满意度", "弱光占比", "开通及时率"],
        data: [
          ["武林", "100%", "98.03%", "87.69%", "3.59"],
          ["西湖", "98.53%", "96.75%", "85.33%", "0.51"],
          ["江干", "99.55%", "96.24%", "90.00%", "3.66"],
          ["拱墅", "100%", "96.30%", "90.00%", "2.06"],
          ["钱塘", "99.35%", "96.88%", "79.55%", "0.66"],
          ["滨江", "98.75%", "100.00%", "88.56%", "1.13"],
          ["萧山", "99.22%", "96.78%", "91.59%", "1.61"],
          ["余杭", "98.90%", "95.63%", "94.19%", "2.45"],
          ["富阳", "98.83%", "99.36%", "95.15%", "1.34"],
          ["临安", "99.18%", "97.50%", "88.56%", "0.77"],
          ["桐庐", "96.58%", "98.46%", "92.31%", "0.77"],
          ["建德", "98.73%", "100%", "96.43%", "0.66"],
          ["淳安", "97.40%", "95.13%", "90.53", "1.07"],
        ],
        headerBGC: "#2c3e50",
        oddRowBGC: "rgba(255,255,255,0)",
        index: false,
        columnWidth: [70],
        align: ["center"],
        waitTime: 3300,
      },
      config2: {
        header: ["区县", "弱光占比", "有线接入率", "维护质量达标率"],
        data: [
          ["武林", "99.32%", "96.96%", "88.08%"],
          ["西湖", "99.26%", "96.57%", "82.83%"],
          ["江干", "99.52%", "97.18%", "89.96%"],
          ["拱墅", "99.23%", "96.93%", "87.14%"],
          ["钱塘", "99.53%", "97.45%", "89.29%"],
          ["滨江", "99.41%", "97.17%", "90.13%"],
          ["萧山", "99.25%", "95.83%", "87.80%"],
          ["余杭", "99.17%", "97.64%", "86.23%"],
          ["富阳", "99.34%", "97.45%", "91.70%"],
          ["临安", "98.46%", "97.14%", "86.44%"],
          ["桐庐", "99.56%", "97.82%", "89.31%"],
          ["建德", "99.3%", "97.61%", "90.97%"],
          ["淳安", "99.00%", "97.54%", "87.43"],
        ],
        waitTime: 4500,
        index: false,
        columnWidth: [70],
        align: ["center"],
        headerBGC: "#2c3e50",
        oddRowBGC: "rgba(255,255,255,0)",
      },
    };
  },
};
</script>

<style lang="less" scoped>
#kpi {
  width: 100%;
  height: 100%;
  display: flex;
  flex-direction: column;
  p {
    margin-bottom: 10px;
    text-align: center;
    color:#fff;
    font-size: 14px;
    font-weight: 500;
  }
  .top {
    flex: 1;
    display: flex;
    flex-direction: column;
  }
  .bottom {
    flex: 1;
    display: flex;
    flex-direction: column;
  }
}
</style>